const quranVerses = [
    {
      verseNumber: "১.সূরা ফাতিহা: ১",
      verse: "যাবতীয় প্রশংসা জগৎসমূহের প্রতিপালক আল্লাহরই জন্য।"
    },
    {
      verseNumber: "২.সূরা বাকারা: ২৫৫",
      verse: "আল্লাহ, তিনি ছাড়া সত্যিকারের কোন উপাস্য নেই, তিনি চিরঞ্জীব, সর্বদা রক্ষণাবেক্ষণকারী। তাঁকে তন্দ্রা ও নিদ্রা স্পর্শ করে না। আকাশমন্ডলে ও ভূমন্ডলে যা কিছু আছে, তাঁরই। কে সেই ব্যক্তি যে তাঁর অনুমতি ছাড়া তাঁর নিকট সুপারিশ করে? তিনি লোকদের সমুদয় প্রকাশ্য ও অপ্রকাশ্য অবস্থা জানেন। পক্ষান্তরে মানুষ তাঁর জ্ঞানের কোনকিছুই আয়ত্ত করতে সক্ষম নয়, তিনি যে পরিমাণ ইচ্ছে করেন সেটুকু ছাড়া। তাঁর কুরসী আকাশ ও পৃথিবী পরিবেষ্টন করে আছে এবং এ দু’য়ের রক্ষণাবেক্ষণ তাঁকে ক্লান্ত করে না, তিনি উচ্চ মর্যাদাশীল, মহান।"
    },
    {
      verseNumber: "৩.সূরা ইমরান: ১৯০",
      verse: "নিশ্চয়ই আসমানসমূহ ও যমীনের সৃষ্টিতে এবং রাত্র ও দিনের আবর্তনে জ্ঞানবানদের জন্য বহু নিদর্শন আছে।"
    },
    {
      verseNumber: "৫.সূরা মায়িদাহ: ৩২",
      verse: "এ কারণেই আমি বানী ইসরাঈলের জন্য বিধান দিয়েছিলাম যে, যে ব্যক্তি মানুষ হত্যা কিংবা যমীনে সন্ত্রাস সৃষ্টির কারণ ব্যতীত কাউকে হত্যা করবে সে যেন তামাম মানুষকেই হত্যা করল। আর যে মানুষের প্রাণ বাঁচালো, সে যেন তামাম মানুষকে বাঁচালো। তাদের কাছে আমার রসূলগণ সুস্পষ্ট প্রমাণ নিয়ে এসেছিল, এরপরও তাদের অধিকাংশই পৃথিবীতে বাড়াবাড়িই করেছিল।"
    },
    {
      verseNumber: "২৪. সূরা নূর: ৩৫",
      verse: "আল্লাহ আসমান ও যমীনের আলো, তাঁর আলোর দৃষ্টান্ত হল যেন একটি তাক- যার ভিতরে আছে একটি প্রদীপ, প্রদীপটি হচ্ছে কাঁচের ভিতরে, কাঁচটি যেন একটি উজ্জ্বল নক্ষত্র, যা প্রজ্জ্বলিত করা হয় বরকতময় যায়তুন গাছের তেল দ্বারা যা পূর্বদেশীয়ও নয়, আর পশ্চিমদেশীয়ও নয়। আগুন তাকে স্পর্শ না করলেও তার তেল যেন উজ্জ্বলের বেশ নিকটবর্তী, আলোর উপরে আলো। আল্লাহ যাকে ইচ্ছে করেন স্বীয় আলোর দিকে পথ দেখান। আল্লাহ মানুষের জন্য দৃষ্টান্ত পেশ করেন, আল্লাহ সর্ববিষয়ে অধিক জ্ঞাত।"
    },
    {
      verseNumber: "৩৩.সূরা আহযাব: ২১",
      verse: "তোমাদের জন্য আল্লাহর রসূলের মধ্যে উত্তম আদর্শ রয়েছে যারা আল্লাহ ও শেষ দিনের আশা রাখে আর আল্লাহকে অধিক স্মরণ করে।"
    },
    {
      verseNumber: "৩৯.সূরা ‍যুমার: ৫৩",
      verse: "বল- হে আমার বান্দাগণ! যারা নিজেদের উপর বাড়াবাড়ি করেছ, তোমরা আল্লাহর রহমত থেকে নিরাশ হয়ো না। আল্লাহ সমস্ত গুনাহ ক্ষমা করে দেবেন। তিনি অতি ক্ষমাশীল, অতি দয়ালু।"
    },
    {
      verseNumber: "৫৫.সূরা রহমান: ১৩",
      verse: "অতএব (হে জ্বিন ও মানুষ!) তোমরা তোমাদের প্রতিপালকের কোন্ কোন্ নিয়ামতকে অস্বীকার করবে?"
    },
    {
      verseNumber: "৫৭.সূরা হাদিদ: ৪",
      verse: "তিনি আসমান ও যমীনকে ছয় দিনে সৃষ্টি করেছেন অতঃপর আরশে সমুন্নত হয়েছেন। তিনি জানেন যা যমীনে প্রবেশ করে, আর যা তাত্থেকে বের হয়, আর যা আকাশ থেকে অবতীর্ণ হয়, আর যা তাতে উঠে যায়, তোমরা যেখানেই থাক তিনি তোমাদের সঙ্গে আছেন, তোমরা যে কাজই কর না কেন, আল্লাহ তা দেখেন।"
    },
    {
      verseNumber: "৯৪.সূরা ইনশিরাহ: ৬",
      verse: "নিঃসন্দেহে কষ্টের সাথেই স্বস্তি আছে।"
    }
  ];
  

document.getElementById('ayat-btn').addEventListener('click', function(){
    const randomVerse = Math.floor(Math.random() * quranVerses.length);
    document.getElementById('verse').innerText = quranVerses[randomVerse].verse;
    document.getElementById('verseNumber').innerText = quranVerses[randomVerse].verseNumber;
  })